/**********************BST-V51实验开发板例程************************
*  平台：BST-V51 + Keil U3 + STC89C52
*  名称：流水灯模块实验
*  公司：深圳市亚博智能科技有限公司         
*  日期：2013-11
*  晶振:11.0592MHZ
*  说明：免费开源，不提供源代码分析.
******************************************************************/
/*---------------------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，
                  //头文件包含特殊功能寄存器的定义
/*-------------------------IO口定义----------------------------*/
sbit P20 = P2^0;//这是为了关闭开发板上的数码管实际应用去掉
sbit P21 = P2^1;//这是为了关闭开发板上的数码管实际应用去掉
sbit CS88 = P2^2;//这是为了关闭开发板上的点阵实际应用去掉
/*------------------------------------------------
                    主函数
------------------------------------------------*/
void main (void)
{
	P1=0x00;//这是为了关闭开发板上的数码管实际应用去掉
	P20=0; //这是为了关闭开发板上的数码管实际应用去掉
	P21=0; //这是为了关闭开发板上的数码管实际应用去掉
	CS88=0; //这是为了关闭开发板上的点阵实际应用去掉
	P1=0xFF;//P1口置1

                  //此方法使用bit位对单个端口赋值
P1=0x55;          //换成二进制是0101 0101 

while (1)         //主循环
  {
                  //主循环中添加其他需要一直工作的程序
  }
}
