/*********************************************************************************
*实验名   ：定时器实验
*实验效果	：第一个LED灯以一秒一次的准确频率开始闪烁
*
*********************************************************************************/
#include<reg52.h>
#include "bstv51.h"

uint i=0;
void Init_timer0(void)
{
    TMOD |= 0X01;         //工作方式1 内部寄存器控制的定时功能
	TH0=0X4C;             //高八位的初值
	TL0=0X00;             //第八位初值
	EA=1;                  //整体中断允许
	ET0=1;                 //定时器0中断允许
	TR0=1;                 //开启定时器0
}

void main()
{
    bstv51_init();	       //初始化
	Init_timer0();		   //定时器配置函数

	while(1)
	{
	    if(i==10)			 //查询是否计够10次
		{
		    L0=~L0;
			i=0;		//注意清0全局变量
		}
	}

}

void Timer0_isr(void)interrupt 1
{
    TH0=0x4C;	  //50ms=(12/11059200)(65535-初值)  初值=19456——————0x4C00
	TL0=0x00;
	i++;
}