/*********************************************************************************
*实验名   ：定时器实验
*实验效果	：第一个LED以定时器0设定的时间周期闪烁
*
*********************************************************************************/
#include<reg52.h>
#include "bstv51.h"

void Init_timer0(void)
{
    TMOD |= 0X01;                      //工作方式1 内部寄存器控制的定时功能
	TH0=0X00;                         //高八位的初值
	TL0=0X00;                         //第八位初值
	EA=1;                            //开启整体中断允许
	ET0=1;                           //开启定时器0中断允许
	TR0=1;							 //开始计数
}

void main()
{
    bstv51_init();
	Init_timer0();

	while(1)
	{
	;
	}

}

void Timer0_isr(void)interrupt 1
{
    TH0=0x00;
	TL0=0x00;
	L0=~L0;
}