/*********************************************************************************
*实验名   ：独立键盘输入
*实验效果	：按第1个独立按键K1 2个红灯亮
*实验效果	：按第2个独立按键K2 2个绿灯亮
*实验效果	：按第3个独立按键K3 2个黄灯亮
*实验效果	：按第4个独立按键K4 2个白灯亮
*
*********************************************************************************/
#include<reg52.h>
#include"bstv51.h"

void main()
{
	bstv51_init();//学习板初始化函数
	P1=0xff; //熄灭所有LED
    while(1)
	{
	    L0=K1;
	    /*if(K1==0)
		{
		    L0=0;
		}
		else
		{L0=1;}*/
		L1=K1;
		L2=K2;
		L3=K2;
		L4=K3;
		L5=K3;
		L6=K4;
		L7=K4;
	}

}